<?php

namespace Hik\FaceApi;
/**
 * Class Dictionary
 * @package HikFace
 */
class  Dictionary
{
    /**
     * @param $dictionaryArrKey
     * @return mixed|string
     */
    public function getMsg ($dictionaryArrKey = '')
    {
        $dictionaryArr = [
            "0x0623003e" => "业务抛出了未捕捉的异常" ,
            "0x06234000" => "必填字段不能为空" ,
            "0x06234001" => "字段合法性校验不通过" ,
            "0x0621100b" => "人脸分组已经被关联到识别计划上,删除分组失败" ,
            "0x0621100c" => "无效的人脸分组编号" ,
            "0x0621100d" => "重复的人脸编号" ,
            "0x0621100e" => "上传任务已过期或唯一标识不正确" ,
            "0x0622300e" => "图片上传失败" ,
            "0x0622300f" => "图片下载失败" ,
            "0x0622300d" => "图片服务器资源池未配置" ,
            "0x0621200b" => "脸谱建模失败" ,
            "0x0621200d" => "人脸数量达到平台上限" ,
            "0x0621200e" => "人脸分组中人脸数量达到上限" ,
            "0x06220203" => "从云存储下载图片失败" ,
            "0x06223003" => "图片像素大小不符合规定" ,
            "0x06223008" => "图片格式类型不支持" ,
            "0x1f93003e" => "业务抛出了未捕捉的异常" ,
            "0x1f934000" => "必填字段不能为空" ,
            "0x1f934001" => "字段合法性校验不通过" ,
            "0x1f91100b" => "人脸分组已经被关联到识别计划上,删除分组失败" ,
            "0x1f91100c" => "无效的人脸分组编号" ,
            "0x1f91100d" => "重复的人脸编号" ,
            "0x1f91100e" => "上传任务已过期或唯一标识不正确" ,
            "0x1f92300e" => "图片上传失败" ,
            "0x1f92300f" => "图片下载失败" ,
            "0x1f92300d" => "图片服务器资源池未配置" ,
            "0x1f91200b" => "脸谱建模失败" ,
            "0x1f91200d" => "人脸数量达到上限" ,
            "0x1f91200e" => "人脸分组中人脸数量达到上限" ,
            "0x1f920203" => "从云存储下载图片失败" ,
            "0x1f923003" => "图片像素大小不符合规定" ,
            "0x1f923008" => "图片格式类型不支持" ,
            "0x1f910000" => "tagId 为空" ,
            "0x1f910001" => "tagId长度非法" ,
            "0x1f910002" => "tagId包含特殊字符" ,
            "0x1f911000" => "分组名称为空" ,
            "0x1f911001" => "人脸分组名称长度非法" ,
            "0x1f911002" => "人脸分组名称包含特殊字符" ,
            "0x1f911005" => "人脸分组描述长度非法" ,
            "0x1f911003" => "人脸分组名称重复" ,
            "0x1f911004" => "人脸分组数量超过限制" ,
            "0x1f913016" => "评分失败" ,
            "0x1f902302" => "评分算法未授权" ,
            "0x1f902066" => "参数错误" ,
            "0x1f902197" => "base64解码失败" ,
            "0x1f910010" => "算法段不存在" ,
            "0x1f900000" => "未知错误" ,
            "0x1f91300b" => "图片url为空" ,
            "0x1f902300" => "人脸检测错误（图片格式不符合要求、检测不到人脸等情况时）" ,
            "0x1f902301" => "人脸检测超时" ,
            "0x1f902303" => "图片两眼间距过小" ,
            "0x1f902304" => "图片彩色置信度过低" ,
            "0x1f902305" => "图片人脸角度过大" ,
            "0x1f902306" => "图片清晰度过低" ,
            "0x1f902307" => "图片过曝或过暗（灰阶值不符合要求）" ,
            "0x1f902308" => "图片遮挡严重" ,
            "0x1f902309" => "图片分数过低" ,
            "0x00072001" => "参数错误：必填参数为空" ,
            "0x00072002" => "参数错误：参数范围不正确" ,
            "0x00072003" => "参数错误：参数格式不正确" ,
            "0x00072004" => "参数错误：未指定分页大小或者分页过大导致返回报文过长" ,
            "0x00052101" => "服务错误：服务性能已达上限" ,
            "0x00052102" => "服务错误：服务异常" ,
            "0x00052103" => "服务错误：服务响应超时" ,
            "0x00052104" => "服务错误：服务不可用" ,
            "0x00072201" => "资源异常：资源访问未授权" ,
            "0x00072202" => "资源异常：资源不存在" ,
            "0x00072203" => "资源异常：License数量受限" ,
            "0x00072204" => "资源异常：License未提供该功能" ,
            "0x00052301" => "其他错误：其他未知错误" ,
            "0x14c00002" => "该用户不存在" ,
            "0x14c00003" => "区域查询条件sonOrgIndexCodes 不合法" ,
            "0x14c00004" => "资源查询条件containSubRegion、exactCondition 不合法" ,
            "0x14c00005" => "资源类型resourceType、权限码authCodes错误" ,
            "0x14c00015" => "当前入参非系统唯一标识" ,
            "0x14c00016" => "Token校验失败" ,
            "0x14c00017" => "SecuSID已过期" ,
            "0x14c00018" => "密钥交换失败" ,
            "0x14c00019" => "加密数据失败" ,
            "0x14c00020" => "解密数据失败" ,
            "0x14c02301" => "批量操作时部分成功、部分失败" ,
            "0x14c02302" => "管理相关权限校验失败" ,
            "0x14c02303" => "资源不存在" ,
            "0x14c02304" => "请求超时" ,
        ];
        if ($dictionaryArrKey == '')
            return $dictionaryArr;
        if (isset($dictionaryArr[$dictionaryArrKey])) {
            return $dictionaryArr[$dictionaryArrKey];
        } else {
            return '请求超时,请稍后重试';
        }
    }
}